# CouldNotAcquireAssemblyViews Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..CouldNotAcquireAssemblyViews Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
The assembly instance could not acquire the assembly views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouldNotAcquireAssemblyViews { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouldNotAcquireAssemblyViews As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouldNotAcquireAssemblyViews {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace